{
  "backend/main.mo": "Main backend canister handling user profiles, mod creation, and file updates with authorization and basic validation.",
  "backend/migration.mo": "Migration module converting old mod and profile data to the new schema with added prompt and gameName fields.",
  "feature_evidence.json": "Feature evidence report listing frontend files and components involved in new mod-creation workflow updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including routes, components, utilities, and pages.",
  "frontend/index.css": "Global Tailwind-based theme definitions with OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, layout, and mounts pages including mod creation and viewing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter a display name and saving it via backend mutation.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication gate component that blocks access to protected pages until the user signs in.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component providing header, navigation with auth actions, main content area, and footer for the app.",
  "frontend/src/components/mods/FileComposer.tsx": "UI for uploading, creating, listing, and removing mod files with validation and file count limits.",
  "frontend/src/components/mods/ModEditorForm.tsx": "Form for editing mod metadata with live validation for title, version, description, and prompt.",
  "frontend/src/components/mods/ModShareLink.tsx": "Displays an unlisted share link for a mod and allows copying it to the clipboard.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login state, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend calls for user profiles and mod CRUD operations.",
  "frontend/src/index.css": "Defines Tailwind layers and theme variables for light and dark modes, applying global background, text, and border styles.",
  "frontend/src/lib/fileLimits.ts": "Provides file upload limits and validation utilities, including size formatting.",
  "frontend/src/lib/unlisted.ts": "Generates 32‑char unlisted IDs and constructs share URLs based on window origin.",
  "frontend/src/lib/validation.ts": "Includes validation helpers for mod metadata fields like title, game name, version, description, and prompt.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the user's mods with loading states and management links within an authenticated dashboard.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public marketing landing page with hero content, features, and onboarding links.",
  "frontend/src/pages/ModCreateWizardPage.tsx": "Implements a multi‑step authenticated wizard for creating a mod, validating inputs, uploading files, and generating an unlisted ID.",
  "frontend/src/pages/ModManagePage.tsx": "Provides an authenticated interface to view mod details and update its files with validation and save actions.",
  "frontend/src/pages/PublicModPage.tsx": "Displays a public mod page fetched by unlisted ID, showing metadata and allowing file downloads with loading and error states.",
  "frontend/src/pages/SignInPage.tsx": "Handles Internet Identity login, redirects authenticated users, and triggers profile setup when needed.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for styling the frontend.",
  "project_state.json": "Describes the project’s state, requirements, features, and architectural notes for the mod‑sharing website."
}