{
  "backend/main.mo": "Actor implementing mod storage, user profiles, and authorization-protected queries and mutations for creating, reading, and updating mods and profiles.",
  "backend/migration.mo": "Migration module passing old actor state through unchanged to the new state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to involved frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of each frontend file.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light and dark theme CSS variables and base element styling.",
  "frontend/index.html": "Basic HTML entry point loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider, layout, and global toaster.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users for a display name and saving the profile via a mutation.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth gate component blocking access when the user is not signed in and showing a sign-in prompt.",
  "frontend/src/components/layout/AppLayout.tsx": "App-wide layout with header, responsive navigation, footer, and branding elements wrapping all pages.",
  "frontend/src/components/layout/ResponsiveHeaderNav.tsx": "Responsive navigation component showing login/logout and mod links, with separate desktop and mobile menus.",
  "frontend/src/components/mods/FileComposer.tsx": "Handles uploading, creating, listing, and removing mod files with validation and text file creation dialog.",
  "frontend/src/components/mods/ModEditorForm.tsx": "Form for editing mod metadata including title, version, description, and prompt with live validation.",
  "frontend/src/components/mods/ModEnabledToggle.tsx": "Toggle switch for enabling or disabling a mod, with loading, error handling, and server update logic.",
  "frontend/src/components/mods/ModShareLink.tsx": "Displays an unlisted share URL for a mod with copy-to-clipboard support and user feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity, refetching dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, including identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping canister actor methods for user profiles, mods, and mod state with cache invalidation.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark theme CSS variables and global focus, border, and body styling.",
  "frontend/src/lib/bedrockFiles.ts": "Utility functions for validating Bedrock mod files by extension, size, count, and formatting size limits.",
  "frontend/src/lib/fileLimits.ts": "Defines file count and size limits with helpers to validate and format file sizes.",
  "frontend/src/lib/unlisted.ts": "Generates random unlisted IDs and builds shareable mod URLs.",
  "frontend/src/lib/validation.ts": "Validates mod metadata fields like title, game name, version, description, and prompt.",
  "frontend/src/lib/webShare.ts": "Helpers for Web Share API capability checks and sharing URLs or files with clipboard fallback.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/BedrockFileOpenerPage.tsx": "Page for selecting, validating, downloading, and sharing Bedrock mod files via Web Share API.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard displaying user profile info and a list of mods with options to create or manage mods.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing landing page with hero banner, CTAs, Bedrock file opener, and feature cards.",
  "frontend/src/pages/ModCreateWizardPage.tsx": "Implements a four‑step authenticated wizard for creating and publishing mods with validation and file handling.",
  "frontend/src/pages/ModManagePage.tsx": "Provides an authenticated interface to view a mod’s info and update its files, including validation and saving changes.",
  "frontend/src/pages/PublicModPage.tsx": "Displays a publicly accessible mod via unlisted link with file downloading, sharing, and error handling.",
  "frontend/src/pages/SignInPage.tsx": "Handles Internet Identity sign‑in flow and redirects users based on profile state, showing a profile setup modal if needed.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins. Extends theme with OKLCH-driven color variables and custom keyframes for UI components.",
  "project_state.json": "Defines the project’s backend-persisted mod toggle feature, listing existing features, new requests, and project metadata. Tracks requirements, versions, and architectural notes for consistent mod enable-state behavior."
}