{
  "backend/main.mo": "Defines data types and CRUD-like functions for mods, story modes, showcases, and user profiles with access control and storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend files, describing their purpose in routing, UI, utilities, and mod-related flows.",
  "frontend/index.css": "Defines global Tailwind base styles and a full OKLCH‑based color theme for light and dark modes.",
  "frontend/index.html": "Basic HTML document mounting the React app and loading the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Sets up the TanStack Router structure, theme provider, layout, and all main application routes.",
  "frontend/src/components/ads/AdGateModal.tsx": "A modal that forces users to watch a 60‑second ad with a countdown before allowing completion of certain actions.",
  "frontend/src/components/ads/AdPlacement.tsx": "Displays a 30‑second advertisement component with countdown, video playback, and fallback UI.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that collects a display name and saves the user profile via mutation with basic validation and toasts.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that checks Internet Identity auth state and shows a sign‑in prompt or loading state before rendering children.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation, footer, and branding, wrapping all page content.",
  "frontend/src/components/layout/ResponsiveHeaderNav.tsx": "Responsive navigation bar providing login/logout and authenticated links for both desktop and mobile via a sheet menu.",
  "frontend/src/components/mods/FileComposer.tsx": "Interface for uploading files or creating text files with validation, limits, and removal controls for mod file sets.",
  "frontend/src/components/mods/ModEditorForm.tsx": "Form for editing mod metadata with live validation for title, version, description, and prompt.",
  "frontend/src/components/mods/ModEnabledToggle.tsx": "Toggle component that loads and updates a mod’s enabled state with error handling and retry.",
  "frontend/src/components/mods/ModShareLink.tsx": "Displays an unlisted mod share URL with copy‑to‑clipboard support and feedback.",
  "frontend/src/components/promo/CreateModSection.tsx": "Promo card component with a button that navigates to the mod creation page.",
  "frontend/src/components/story/StoryModeSectionLayout.tsx": "Layout wrapper for story mode sections with title, description, optional actions, and children.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAdCountdown.ts": "Hook providing a countdown timer with start, pause, reset, and completion callbacks.",
  "frontend/src/hooks/useAudioRecorder.ts": "Hook for recording audio using MediaRecorder with controls, timing, and blob/url output.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication and status.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, story modes, and stubbed mod operations using the backend actor.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Hook wrapping the Web Speech API to speak text and track speaking state.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light/dark modes and feature-specific color themes.",
  "frontend/src/lib/bedrockFiles.ts": "Utilities for validating Minecraft Bedrock mod files, extensions, sizes, and count limits.",
  "frontend/src/lib/dialogue.ts": "Helpers for adding or removing surrounding quotes from text.",
  "frontend/src/lib/fileLimits.ts": "Defines file upload limits and helpers for validating counts and sizes and formatting byte values.",
  "frontend/src/lib/modTypes.ts": "Declares interfaces for mod files and mod metadata used as frontend stubs.",
  "frontend/src/lib/storyModeTypes.ts": "Defines form types and creators for chapters, quests, and scenes plus conversion to backend format.",
  "frontend/src/lib/unlisted.ts": "Generates random unlisted IDs and builds share URLs for mods and characters.",
  "frontend/src/lib/validation.ts": "Provides validation helpers for mod titles, descriptions, prompts, versions, and game names.",
  "frontend/src/lib/voiceAtmospherePresets.ts": "Defines voice atmosphere presets and a lookup function by ID.",
  "frontend/src/lib/webShare.ts": "Implements Web Share API capability checks, URL/file sharing, and clipboard fallback.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/BedrockFileOpenerPage.tsx": "UI for selecting, validating, sharing, and downloading Bedrock .mcpack/.mcaddon files.",
  "frontend/src/pages/CharacterShowcaseCreatorPage.tsx": "Provides UI and logic for creating and publishing character showcases with media uploads.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the user dashboard with navigation to Story Mode and Character Showcase sections.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero, navigation buttons, ad placement, and feature cards.",
  "frontend/src/pages/ModCreateWizardPage.tsx": "Four‑step wizard for creating mods with validation and file composition.",
  "frontend/src/pages/ModManagePage.tsx": "Mod management page that fetches mod data and shows a disabled backend warning.",
  "frontend/src/pages/PublicCharacterShowcasePage.tsx": "Public page displaying a shared character’s media, name, and description.",
  "frontend/src/pages/PublicModPage.tsx": "Public mod view that attempts to load a mod by unlisted ID but shows a backend-disabled alert.",
  "frontend/src/pages/SignInPage.tsx": "Sign‑in page using Internet Identity with automatic redirect and optional profile setup.",
  "frontend/src/pages/StoryModeEditPage.tsx": "Editor for creating or updating story modes with chapters, quests, scenes, and media features.",
  "frontend/src/pages/StoryModeHomePage.tsx": "Displays a list of story modes with loading, empty, and card views plus actions to create, play, or edit stories. Wrapped in authentication and uses layout and UI components.",
  "frontend/src/pages/StoryModePlayerPage.tsx": "Loads and plays through a story’s chapters and scenes with navigation controls and optional speech synthesis. Handles loading, error, and missing-content states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, persisting, and clearing URL parameters and related session storage values. Supports both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, and custom color groups including story/showcase/ad, with animation and typography plugins.",
  "project_state.json": "Describes the project’s feature state, including new mod creation UI placement and video ad requirements, along with existing features and metadata."
}