{
  "kind": "build_request",
  "title": "Persist mod on/off toggle so all devices load the same state",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Persist each mod’s enabled/disabled state in the backend so that when the mod creator toggles the mod on/off on one device, the same enabled state is returned when the creator opens the app on any other device (including consoles).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make it so if you toggle it on It will be toggled on on all devices including  Consoles",
          "Let it load the same value",
          "Proceed with the build"
        ]
      },
      "acceptanceCriteria": [
        "When a creator toggles a mod to Disabled on Device A, then opens the mod management page on Device B, the toggle loads as Disabled without relying on local storage.",
        "When a creator toggles a mod to Enabled on Device A, then opens the public/unlisted link, the mod is accessible again.",
        "The enabled state is fetched from the backend and not derived from client-only state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enforce access control for enabled-state operations: only the mod creator (or an admin) can read or update a mod’s enabled/disabled state by modId.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I amtalking about the toggle that turns the mod on or off",
          "Across all devices including console"
        ]
      },
      "acceptanceCriteria": [
        "A non-creator, non-admin authenticated user cannot read a mod’s enabled state via the backend API.",
        "A non-creator, non-admin authenticated user cannot change a mod’s enabled state via the backend API.",
        "The mod creator can read and update the enabled state successfully."
      ]
    },
    {
      "id": "REQ-3",
      "text": "When a mod is disabled, block public/unlisted access so that requests to fetch a mod by unlistedId do not return the mod/files while disabled.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Let it load the same value"
        ]
      },
      "acceptanceCriteria": [
        "If a mod is disabled, backend calls to fetch the mod via its unlistedId fail (do not return mod data or files).",
        "If the same mod is re-enabled, backend calls to fetch the mod via its unlistedId succeed again."
      ]
    },
    {
      "id": "REQ-4",
      "text": "On the mod management page, render a mod on/off toggle UI directly below the existing share link section; the toggle must load the current enabled state from the backend and update it via a backend mutation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I amtalking about the toggle that turns the mod on or off"
        ]
      },
      "acceptanceCriteria": [
        "The mod management page shows a toggle below the share link area for the current mod.",
        "The toggle shows a loading state until the enabled value is fetched from the backend.",
        "Toggling shows success and error feedback in English and updates the displayed state after the backend confirms the change."
      ]
    },
    {
      "id": "REQ-5",
      "text": "On the public mod page, handle disabled mods gracefully by showing an English “mod unavailable/disabled” message instead of broken UI when the backend denies access because the mod is disabled.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Let it load the same value"
        ]
      },
      "acceptanceCriteria": [
        "Opening a disabled mod’s unlisted link shows a clear English message indicating the mod is unavailable/disabled.",
        "The page does not render download/share actions when the mod cannot be fetched due to being disabled."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files in frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui)."
  ],
  "nonGoals": [
    "Instant real-time syncing of the toggle across devices while both are open (e.g., via websockets/push).",
    "Adding third-party authentication beyond Internet Identity.",
    "Adding external databases or non-IC persistence layers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}