{
  "kind": "build_request",
  "title": "Add Create Mod section above creator pages and implement video game ad experiences",
  "projectName": "Grylie's Mods",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a prominent “Create Mod” section that appears above the main content (above any existing tab navigation where present) on creator-oriented pages so it is shown above both the Create Character and Create Story Mode experiences, and link the section to the existing Mod Create route (/create).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-10"
        ],
        "quotes": [
          "The create mod is above both the create character and create story mode",
          "1."
        ]
      },
      "acceptanceCriteria": [
        "On the Character Showcase creator page (/character-showcase), a “Create Mod” section is rendered at the top of the page content, above the existing header and form content, and clicking its primary CTA navigates to /create.",
        "On the Story Mode editor page (/story-mode/edit/$storyId), a “Create Mod” section is rendered above the story editor’s main content, and if tabs are present on the page it appears above the tab navigation.",
        "The “Create Mod” section is visually consistent with the app’s UI component style (Card/Button/etc.) and uses English user-facing text."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Integrate 30-second “video game ads” into the website by adding an ad placement component that can display a 30-second ad experience (video player UI with a visible 30-second countdown and clear “Advertisement” labeling) on key pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "also put video game ADS that are 30 seconds on the webpage"
        ]
      },
      "acceptanceCriteria": [
        "A reusable ad placement component exists and can be embedded on multiple pages without duplicating logic.",
        "The 30-second ad placement shows an “Advertisement” label and a 30-second countdown timer that updates while the ad is playing.",
        "At least the Landing page (/) and Dashboard (/dashboard) include a 30-second ad placement rendered within the page layout (not via the backend).",
        "All user-facing strings related to ads are in English."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Require creators to watch a 1-minute video game advertisement after successfully finishing/publishing a project by gating completion flows with a mandatory 60-second ad modal that cannot be dismissed until the countdown completes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Make it so when creators are done with their projects they have to watch a 1 minute video game advertisement Box PlayStation mobile Nintendo etcetera"
        ]
      },
      "acceptanceCriteria": [
        "After a successful Story Mode save that navigates away from the editor (e.g., the current “Story saved successfully” flow), a modal gate is shown that requires a full 60-second ad watch before allowing the user to continue to the destination page.",
        "After a successful Character Showcase publish/update (the current publish flow in CharacterShowcaseCreatorPage), a modal gate is shown that requires a full 60-second ad watch before the user can proceed (e.g., before interacting with the success/share UI).",
        "The required 60-second ad gate clearly indicates it is an advertisement and shows a visible countdown from 60 seconds to 0.",
        "The required ad gate cannot be closed/skipped before completion (no close button, overlay click disabled, Escape key disabled).",
        "If the ad video cannot load, the gate still enforces a 60-second countdown with a clear message indicating the ad is unavailable, and still cannot be skipped."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Establish and apply a cohesive, modern visual theme for the new “Create Mod” section and ad UI (colors, typography accents, and layout), consistent across all placements, without using a blue/purple primary theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-14"
        ],
        "quotes": [
          "Proceed to build"
        ]
      },
      "acceptanceCriteria": [
        "The “Create Mod” section and all ad UI (30-second placements and 60-second gate modal) share consistent styling (spacing, card treatment, headings, CTA button style).",
        "The chosen theme avoids blue/purple as the primary brand look and feels coherent with the existing Tailwind/shadcn design language.",
        "All user-facing text introduced by these changes is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components must be composed, not modified).",
    "Do not modify any frontend immutable paths listed in SYSTEM_CONTEXT (including identity/actor hooks and main bootstrap files).",
    "Keep backend as a single Motoko actor; do not add additional backend services."
  ],
  "nonGoals": [
    "Integrating with real third-party ad networks (e.g., Google AdSense) or implementing ad targeting/analytics.",
    "Adding payments, subscriptions, or revenue tracking related to ads.",
    "Implementing real-time ad verification beyond the local UI countdown gate."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}