{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Persisted mod enabled/disabled toggle UI and disabled-mod handling",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the mod enabled/disabled state shown in the UI is fetched from backend state (not client-only) and updates after backend-confirmed changes.",
      "acceptanceCriteria": [
        "When a creator toggles a mod to Disabled on Device A, then opens the mod management page on Device B, the toggle loads as Disabled without relying on local storage.",
        "When a creator toggles a mod to Enabled on Device A, then opens the public/unlisted link, the mod is accessible again.",
        "The enabled state is fetched from the backend and not derived from client-only state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the enabled-state query/mutation wiring to keep React Query cache in sync with backend state (e.g., set the ['mod', modId, 'enabled'] cached value on successful mutation and continue invalidating dependent queries) so toggles reliably reflect the backend-persisted enabled state across reloads/devices."
        },
        {
          "path": "frontend/src/components/mods/ModEnabledToggle.tsx",
          "operation": "modify",
          "description": "Ensure the toggle UI always renders from the backend-fetched enabled state and refreshes the displayed state after backend confirmation (e.g., rely on updated query cache or refetch), without introducing any local-storage persistence."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Render a mod on/off toggle under the share link section that loads current enabled state from backend and updates it via backend mutation with loading + success/error feedback.",
      "acceptanceCriteria": [
        "The mod management page shows a toggle below the share link area for the current mod.",
        "The toggle shows a loading state until the enabled value is fetched from the backend.",
        "Toggling shows success and error feedback in English and updates the displayed state after the backend confirms the change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ModManagePage.tsx",
          "operation": "modify",
          "description": "Confirm the existing toggle placement remains directly below the share link section and that the correct modId is passed through for backend-backed loading/mutation (no new routes/pages)."
        },
        {
          "path": "frontend/src/components/mods/ModEnabledToggle.tsx",
          "operation": "modify",
          "description": "Add explicit loading and error UI states for fetching enabled status (e.g., show an English inline error message + optional retry when the backend read fails), and ensure mutation pending state is clearly represented while preventing double-toggles; keep English success/error toasts and update the displayed state only after backend confirmation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden enabled-state hooks to support the toggle UX: expose needed error/refetch signals from the enabled-state query (if required by the UI changes) and ensure the enabled-state mutation updates/invalidate queries so the UI reflects the backend-confirmed value."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "On the public mod page, show a clear English disabled/unavailable message and hide download/share UI when backend denies access for disabled mods.",
      "acceptanceCriteria": [
        "Opening a disabled mod’s unlisted link shows a clear English message indicating the mod is unavailable/disabled.",
        "The page does not render download/share actions when the mod cannot be fetched due to being disabled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PublicModPage.tsx",
          "operation": "modify",
          "description": "Improve disabled-mod detection and messaging when getModByUnlistedId fails: treat backend denial/trap messages indicating disabled/unavailable as the disabled case (not only 'Mod not found'), render a clear English 'mod unavailable/disabled' message, and ensure no download/share actions are rendered when mod data is not available."
        }
      ]
    }
  ]
}